
#Область ПрограммныйИнтерфейс

// Функция получает хеш-сумму от значения.
//
// Параметры:
//  Значение - Строка - значение от которого необходимо посчитать сумму.
//
// Возвращаемое значение:
//  Строка - строка из значением хеш-суммы, Неопределено если возникли ошибки.
//
Функция ПолучитьХешМД5(Значение) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		ВызватьИсключение НСтр("ru='Неверный параметр для получения хеш-суммы.'");
		Возврат Неопределено;
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(Значение);
	
	ТипДвоичныеДанные 	= ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary");
	ДвоичныеДанные 		= ФабрикаXDTO.Создать(ТипДвоичныеДанные, ХешированиеДанных.ХешСумма);
	
	Возврат ДвоичныеДанные.ЛексическоеЗначение;

КонецФункции

#КонецОбласти